app/controllers/account_activations_controller.rb

  def edit
    user = User.find_by email: params[:email]
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'hvsson1102@gmail.com' LIMIT 1