app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by email: params[:password_reset][:email].downcase
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'hvsson102@gmail.com' LIMIT 1

  def update
    if params[:user][:password].blank?
      @user.errors.add :password, t(".error")
      render :edit
    elsif @user.update(user_params)
      log_in @user
      @user.update_attribute(:reset_digest, nil)
---
UPDATE `users` SET `users`.`updated_at` = '2022-01-05 08:25:15.198524', `users`.`password_digest` = '$2a$12$2hwT92ghucbwanLvW/z/l.33uITHoIFuS0wAMi5Ik3PrrcUVDjQxC' WHERE `users`.`id` = 63

  def get_user
    @user = User.find_by email: params[:email]
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'hvsson102@gmail.com' LIMIT 1