app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0
---
  def index
    @pagy, @users = pagy(User.all, items: Settings.item_in_page)

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Hoang van son', 'aaaaa@gmail.com', '2021-12-28 03:27:21.736763', '2021-12-28 03:27:21.736763', '$2a$12$pUUUXdcGfBqSdhNfEQbRUOWn5nbiE5rP5g91K9CWGlptX0sl7pWAa')
---
  def create
    @user = User.new user_params
    if @user.save

UPDATE `users` SET `users`.`name` = 'Hoang van son1', `users`.`updated_at` = '2021-12-28 02:41:44.250056' WHERE `users`.`id` = 1
---
  def update
    if @user.update user_params

DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    if @user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def correct_user
    @user = User.find params[:id]

SELECT `users`.* FROM `users` WHERE `users`.`id` = 63 LIMIT 1
---
  def load_user
    @user = User.find_by id: params[:id]